# Homebrew packages for the dotfiles setup.
# Install with: brew bundle --file=.brewfile
# casks are macOS-only and filtered out automatically on Linux (see lib/install.sh).
# AI CLIs (Claude Code, Gemini) are NOT here — they live in lib/ai.sh.

# Core utilities
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "grep"
brew "wget"
brew "curl"

# Modern CLI tools
brew "jq"           # JSON processor
brew "yq"           # YAML processor

# Development tools
brew "git"
brew "nvm"
brew "python@3.13"
brew "poetry"
brew "pipx"
brew "pnpm"

# Shell enhancements
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship"

# Docker orchestration
brew "lazydocker"

# Security tools
brew "gnupg"
brew "openssh"
brew "openssl"

# Utilities
brew "fileicon"              # custom macOS app icons

# Fonts (macOS)
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-cascadia-code"
cask "font-hack-nerd-font"
cask "font-meslo-for-powerline"
cask "font-meslo-lg"

# Applications (macOS)
cask "1password"
cask "dbeaver-community"
cask "ghostty"
cask "google-chrome"
cask "vscodium"
cask "spotify"
cask "vlc"
