adpyke.codesnap
biomejs.biome
charliermarsh.ruff
csstools.postcss
dbaeumer.vscode-eslint
dracula-theme.theme-dracula
eamodio.gitlens
esbenp.prettier-vscode
jeanp413.open-remote-ssh
ms-python.debugpy
ms-python.python
ms-python.vscode-python-envs
naumovs.color-highlight
pkief.material-icon-theme
shd101wyy.markdown-preview-enhanced
yoavbls.pretty-ts-errors
